src/DataProcessors/НастройкиМобильногоПриложения/НастройкиМобильногоПриложения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>НастройкиМобильногоПриложения</name>
</mdclass:DataProcessor>

src/InformationRegisters/ИзмененныеНастройкиСинхронизацииСМобильнымКлиентом/ИзмененныеНастройкиСинхронизацииСМобильнымКлиентом.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ИзмененныеНастройкиСинхронизацииСМобильнымКлиентом</name>
  <resources>
    <name>ОтметкаВремени</name>
    <type>
      <types>DefinedType.ОтметкаВремени</types>
    </type>
  </resources>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Настройка</name>
    <type>
      <types>EnumRef.ВидыНастроекОбменаСМобильнымКлиентом</types>
      <types>EnumRef.ОбменСМобильнымиТипыНастроекПользователей</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Enums/ОбменСМобильнымиТипыНастроекПользователей/ОбменСМобильнымиТипыНастроекПользователей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ОбменСМобильнымиТипыНастроекПользователей</name>
  <enumValues>
    <name>ВидРаботПоУмолчанию</name>
  </enumValues>
  <enumValues>
    <name>ИспользоватьPushУведомления</name>
  </enumValues>
  <enumValues>
    <name>МаксимальныйРазмерВложения</name>
  </enumValues>
  <enumValues>
    <name>МаксимальныйРазмерФайлов</name>
  </enumValues>
  <enumValues>
    <name>ОграничениеФорматовПередаваемыхФайлов</name>
  </enumValues>
  <enumValues>
    <name>ПериодПервичнойЗагрузки</name>
  </enumValues>
  <enumValues>
    <name>ПодробныйПротоколОбменаСМобильнымУстройством</name>
  </enumValues>
  <enumValues>
    <name>ПроектПоУмолчанию</name>
  </enumValues>
  <enumValues>
    <name>СинхронизацияАдреснойКниги</name>
  </enumValues>
  <enumValues>
    <name>СинхронизацияЗадач</name>
  </enumValues>
  <enumValues>
    <name>СинхронизацияКалендаря</name>
  </enumValues>
  <enumValues>
    <name>СинхронизацияКонтроля</name>
  </enumValues>
  <enumValues>
    <name>СинхронизацияМероприятий</name>
  </enumValues>
  <enumValues>
    <name>СинхронизацияОтсутствий</name>
  </enumValues>
  <enumValues>
    <name>СинхронизацияПочты</name>
  </enumValues>
  <enumValues>
    <name>СинхронизацияСамочувствий</name>
  </enumValues>
  <enumValues>
    <name>СинхронизацияУчетаВремени</name>
  </enumValues>
  <enumValues>
    <name>СпособУказанияВремени</name>
  </enumValues>
  <enumValues>
    <name>СрокУстареванияДанных</name>
  </enumValues>
  <enumValues>
    <name>ФорматыПередаваемыхФайлов</name>
  </enumValues>
</mdclass:Enum>

src/Enums/ВидыНастроекОбменаСМобильнымКлиентом/ВидыНастроекОбменаСМобильнымКлиентом.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыНастроекОбменаСМобильнымКлиентом</name>
  <enumValues>
    <name>МаксимальныйРазмерФайла</name>
  </enumValues>
  <enumValues>
    <name>СинхронизацияПапокПисем</name>
  </enumValues>
  <enumValues>
    <name>СинхронизироватьЗадачи</name>
  </enumValues>
  <enumValues>
    <name>СинхронизироватьКалендарь</name>
  </enumValues>
  <enumValues>
    <name>СинхронизироватьКонтроль</name>
  </enumValues>
  <enumValues>
    <name>СинхронизироватьМоиОтсутствия</name>
  </enumValues>
  <enumValues>
    <name>СинхронизироватьПочту</name>
  </enumValues>
  <enumValues>
    <name>СрокУстареванияДанных</name>
  </enumValues>
  <enumValues>
    <name>ШаблоныТекстовПисем</name>
  </enumValues>
</mdclass:Enum>

src/DataProcessors/НастройкиМобильногоПриложения/Forms/ОбщиеНастройки/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	// Пропускаем инициализацию, чтобы гарантировать получение формы при передаче параметра "АвтоТест".
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	Параметры.Свойство("ТекущийПользователь", ТекущийПользователь);
	
	Если Не ЗначениеЗаполнено(ТекущийПользователь) Тогда
		ТекущийПользователь = Пользователи.ТекущийПользователь();
	КонецЕсли;
	
	ЗагрузитьНастройки();

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Заголовок = СтрШаблон("%1: %2", Заголовок, ТекущийПользователь);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ФильтроватьПередаваемыеНаКлиентФайлыПриИзменении(Элемент)

	Элементы.ФорматыПередаваемыхФайлов.Доступность = ФильтроватьПередаваемыеНаКлиентФайлы;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Готово(Команда)

	Если Не ЗначениеЗаполнено(ТекущийПользователь) Тогда

		Сообщение = Новый СообщениеПользователю();
		Сообщение.Поле  = "ТекущийПользователь";
		Сообщение.Текст = "Не выбран пользователь";
		Сообщение.Сообщить();

		Возврат;

	КонецЕсли;

	ЗаписатьОбщиеНастройкиСинхронизации();
	ЗаписатьНастройкиПередачиФайлов();

	Закрыть(НастройкиИзменены);

КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	
	Закрыть(Ложь);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ОбщиеНастройкиСинхронизации

&НаСервере
Процедура ЗагрузитьНастройки()

	ЗагрузитьОбщиеНастройкиСинхронизации();
	ЗагрузитьНастройкиПередачиФайлов();

КонецПроцедуры 

&НаСервере
Процедура ЗагрузитьОбщиеНастройкиСинхронизации()

	МаксимальныйРазмерПередаваемогоФайла = 
		РегистрыСведений.ОбменСМобильнымиНастройкиПользователей.ПолучитьНастройку(
			ТекущийПользователь,
			Перечисления.ОбменСМобильнымиТипыНастроекПользователей.МаксимальныйРазмерФайлов);

	МаксимальныйРазмерПередаваемогоФайлаПриОткрытии = МаксимальныйРазмерПередаваемогоФайла;
	
	СрокУстареванияДанных = РегистрыСведений.ОбменСМобильнымиНастройкиПользователей.ПолучитьНастройку(
		ТекущийПользователь,
		Перечисления.ОбменСМобильнымиТипыНастроекПользователей.СрокУстареванияДанных);

	СрокУстареванияДанныхПриОткрытии = СрокУстареванияДанных;

	ПодробныйПротоколОбменаСУстройством = РегистрыСведений.ОбменСМобильнымиНастройкиПользователей.ПолучитьНастройку(
		ТекущийПользователь,
		Перечисления.ОбменСМобильнымиТипыНастроекПользователей.ПодробныйПротоколОбменаСМобильнымУстройством);

	ПодробныйПротоколОбменаСУстройствомПриОткрытии = ПодробныйПротоколОбменаСУстройством;

КонецПроцедуры 

&НаСервере
Процедура ЗаписатьОбщиеНастройкиСинхронизации()
	
	НастройкиИзменены = Ложь;
	
	РегистрыСведений.ОбменСМобильнымиНастройкиПользователей.ЗаписатьНастройку(
		ТекущийПользователь,
		Перечисления.ОбменСМобильнымиТипыНастроекПользователей.МаксимальныйРазмерФайлов,
		МаксимальныйРазмерПередаваемогоФайла);

	Если МаксимальныйРазмерПередаваемогоФайлаПриОткрытии <> МаксимальныйРазмерПередаваемогоФайла Тогда
		РегистрыСведений.ИзмененныеНастройкиСинхронизацииСМобильнымКлиентом.ДобавитьЗапись(
			ТекущийПользователь,
			Перечисления.ВидыНастроекОбменаСМобильнымКлиентом.МаксимальныйРазмерФайла);
		НастройкиИзменены = Истина;
	КонецЕсли;

	РегистрыСведений.ОбменСМобильнымиНастройкиПользователей.ЗаписатьНастройку(
		ТекущийПользователь,
		Перечисления.ОбменСМобильнымиТипыНастроекПользователей.СрокУстареванияДанных,
		СрокУстареванияДанных);

	Если СрокУстареванияДанных <> СрокУстареванияДанныхПриОткрытии Тогда
		// добавление записи об изменившейся настройке срока устаревания данных
		РегистрыСведений.ИзмененныеНастройкиСинхронизацииСМобильнымКлиентом.ДобавитьЗапись(
			ТекущийПользователь,
			Перечисления.ВидыНастроекОбменаСМобильнымКлиентом.СрокУстареванияДанных);
		НастройкиИзменены = Истина;
		
	КонецЕсли;

	Если ФильтроватьПередаваемыеНаКлиентФайлы <> ФильтроватьПередаваемыеНаКлиентФайлыПриОткрытии Тогда
		// добавление записи об изменившейся настройке срока устаревания данных
		РегистрыСведений.ИзмененныеНастройкиСинхронизацииСМобильнымКлиентом.ДобавитьЗапись(
			ТекущийПользователь,
			Перечисления.ВидыНастроекОбменаСМобильнымКлиентом.СрокУстареванияДанных);
		НастройкиИзменены = Истина;
	КонецЕсли;
	
	РегистрыСведений.ОбменСМобильнымиНастройкиПользователей.ЗаписатьНастройку(
		ТекущийПользователь,
		Перечисления.ОбменСМобильнымиТипыНастроекПользователей.ПодробныйПротоколОбменаСМобильнымУстройством,
		ПодробныйПротоколОбменаСУстройством);

КонецПроцедуры

#КонецОбласти

#Область НастройкиСинхронизацииФайлов

&НаСервере
Процедура ЗагрузитьНастройкиПередачиФайлов()

	ФильтроватьПередаваемыеНаКлиентФайлы = РегистрыСведений.ОбменСМобильнымиНастройкиПользователей.ПолучитьНастройку(
			ТекущийПользователь,
			Перечисления.ОбменСМобильнымиТипыНастроекПользователей.ОграничениеФорматовПередаваемыхФайлов);
	ФильтроватьПередаваемыеНаКлиентФайлыПриОткрытии = ФильтроватьПередаваемыеНаКлиентФайлы;
	
	ФорматыПередаваемыхФайлов = ВРег(РегистрыСведений.ОбменСМобильнымиНастройкиПользователей.ПолучитьНастройку(
			ТекущийПользователь,
			Перечисления.ОбменСМобильнымиТипыНастроекПользователей.ФорматыПередаваемыхФайлов));
			
	ФорматыПередаваемыхФайловПриОткрытии = ФорматыПередаваемыхФайлов;
	
	Элементы.ФорматыПередаваемыхФайлов.Доступность = ФильтроватьПередаваемыеНаКлиентФайлы;

КонецПроцедуры

&НаСервере
Процедура ЗаписатьНастройкиПередачиФайлов()

	Если ФильтроватьПередаваемыеНаКлиентФайлы <> ФильтроватьПередаваемыеНаКлиентФайлыПриОткрытии Тогда
		
		РегистрыСведений.ОбменСМобильнымиНастройкиПользователей.ЗаписатьНастройку(
			ТекущийПользователь,
			Перечисления.ОбменСМобильнымиТипыНастроекПользователей.ОграничениеФорматовПередаваемыхФайлов,
			ФильтроватьПередаваемыеНаКлиентФайлы);
			
		РегистрыСведений.ИзмененныеНастройкиСинхронизацииСМобильнымКлиентом.ДобавитьЗапись(
			ТекущийПользователь,
			Перечисления.ОбменСМобильнымиТипыНастроекПользователей.ОграничениеФорматовПередаваемыхФайлов);
			
	КонецЕсли;

	Если ФорматыПередаваемыхФайлов <> ФорматыПередаваемыхФайловПриОткрытии Тогда
		
		РегистрыСведений.ОбменСМобильнымиНастройкиПользователей.ЗаписатьНастройку(
			ТекущийПользователь,
			Перечисления.ОбменСМобильнымиТипыНастроекПользователей.ФорматыПередаваемыхФайлов,
			ФорматыПередаваемыхФайлов);
			
		РегистрыСведений.ИзмененныеНастройкиСинхронизацииСМобильнымКлиентом.ДобавитьЗапись(
			ТекущийПользователь,
			Перечисления.ОбменСМобильнымиТипыНастроекПользователей.ФорматыПередаваемыхФайлов);
			
	КонецЕсли;

КонецПроцедуры 

#КонецОбласти

#КонецОбласти
